---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService
source: html/f9f90d3c-acbc-bb73-ce9e-3730c097f245.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService Property

The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation.
 To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer .

## Syntax (C#)
```csharp
public static ExternalServiceId DuctFittingAndAccessoryPressureDropService { get; }
```